CSI API ETABS v1
cPointObj.SetPanelZone Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPanelZone(
	string Name,
	int PropType,
	double Thickness,
	double K1,
	double K2,
	string LinkProp,
	int Connectivity,
	int LocalAxisFrom,
	double LocalAxisAngle,
	eItemType ItemType = eItemType.Objects
)
Function SetPanelZone (
	Name As String,
	PropType As Integer,
	Thickness As Double,
	K1 As Double,
	K2 As Double,
	LinkProp As String,
	Connectivity As Integer,
	LocalAxisFrom As Integer,
	LocalAxisAngle As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim PropType As Integer
Dim Thickness As Double
Dim K1 As Double
Dim K2 As Double
Dim LinkProp As String
Dim Connectivity As Integer
Dim LocalAxisFrom As Integer
Dim LocalAxisAngle As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetPanelZone(Name,
	PropType, Thickness, K1, K2, LinkProp,
	Connectivity, LocalAxisFrom, LocalAxisAngle,
	ItemType)
int SetPanelZone(
	String^ Name,
	int PropType,
	double Thickness,
	double K1,
	double K2,
	String^ LinkProp,
	int Connectivity,
	int LocalAxisFrom,
	double LocalAxisAngle,
	eItemType ItemType = eItemType::Objects
)
abstract SetPanelZone :
        Name : string *
        PropType : int *
        Thickness : float *
        K1 : float *
        K2 : float *
        LinkProp : string *
        Connectivity : int *
        LocalAxisFrom : int *
        LocalAxisAngle : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
PropType
Type: System.Int32
Thickness
Type: System.Double
K1
Type: System.Double
K2
Type: System.Double
LinkProp
Type: System.String
Connectivity
Type: System.Int32
LocalAxisFrom
Type: System.Int32
LocalAxisAngle
Type: System.Double
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace